import type { Deck } from '../../../types'
import { mem } from '../../helpers'

/**
 * S2 · 2티어 덱
 */
export const s2Tier2Decks: Deck[] = [
  {
    id: 's2-t2-zhaoyun-ganfuren-liubei',
    name: '조운·감부인·유비',
    season: 'S2',
    tier: 2,
    formation: '어린진',
    members: [
      mem('조운', '연전연승', '예리한 통찰', ['찬란한 위명'], ['신용', '기예', '승민']),
      mem('감부인', '금성의 철벽', '준비 완료', ['백전불태', '전쟁 종식'], [
        '한녀전',
        '수세',
        '기예',
      ]),
      mem('유비', '천하평론', '보급 차단', ['허실간파'], ['선용', '절봉', '여군']),
    ],
  },
  {
    id: 's2-t2-zhangliao-zhenji-yuejin',
    name: '장료·견희·악진',
    season: 'S2',
    tier: 2,
    formation: '언월진',
    members: [
      mem('장료', '요새함락', '찬란한 위명', ['기습 제압', '기민한 전술'], [
        '기전',
        '왕도',
        '구전',
      ]),
      mem('견희', '허점 공략', '백전불태', ['전쟁 종식', '일심협력'], [
        '<낙신부>하',
        '선용',
        '적용',
      ]),
      mem('악진', '팔방전', '천하평론', ['칠군수몰'], ['동등', '병령', '수토']),
    ],
  },
  {
    id: 's2-t2-sunquan-zhutai-luxun',
    name: '손권·주태·육손',
    season: 'S2',
    tier: 2,
    formation: '언월진',
    members: [
      mem('손권', '맹렬한 화염', '예측의 신', ['칠군수몰'], ['후주', '병교', '수토']),
      mem('주태', '금성의 철벽', '일심협력', ['예측의 신'], ['불굴', '합모', '수세']),
      mem('육손', '도광양회', '세금 과징수', ['지혜의 바람'], ['초량', '탈계', '탈계']),
    ],
  },
  {
    id: 's2-t2-ganfuren-zhaoyun-huangyueying',
    name: '감부인·조운·황월영',
    season: 'S2',
    tier: 2,
    formation: '추형진',
    members: [
      mem('감부인', '백전불태', '문과 양', ['준비 완료', '전쟁 종식'], [
        '한녀전',
        '수세',
        '기예',
      ]),
      mem('조운', '병력강화', '용맹한 삼군', ['예리한 통찰', '찬란한 위명'], [
        '신용',
        '기예',
        '승민',
      ]),
      mem('황월영', '준비 완료', '금성의 철벽', ['광풍의 분노', '보급 차단'], [
        '기관술',
        '합모',
        '선용',
      ]),
    ],
  },
  {
    id: 's2-t2-xiaoqiao-luxun-sunquan',
    name: '소교·육손·손권',
    season: 'S2',
    tier: 2,
    formation: '추형진',
    members: [
      mem('소교', '예측의 신', '기문둔갑', ['방화범', '속수무책'], ['공근신', '기동', '여심']),
      mem('육손', '도광양회', '세금 과징수', ['지혜의 바람'], ['분량', '탈계', '기동']),
      mem('손권', '맹렬한 화염', '청낭 치료', ['허점 공략', '청풍 질주'], [
        '후주',
        '기동',
        '여심',
      ]),
    ],
  },
  {
    id: 's2-t2-xiahoudun-simayi-dengai',
    name: '하후돈·사마의·등애',
    season: 'S2',
    tier: 2,
    formation: '기형진',
    members: [
      mem('하후돈', '세금 과징수', '전략지원', ['난공불락', '허점 공략', '견고한 방어'], [
        '위협',
        '적무',
        '수토',
      ]),
      mem('사마의', '연전연승', '문과 양', ['허실간파', '충신의 기재'], [
        '대략',
        '기지',
        '요적',
      ]),
      mem('등애', '준비 완료', '금성의 철벽', ['보급 차단', '백전불태'], [
        '제하론',
        '합모',
        '위사',
      ]),
    ],
  },
  {
    id: 's2-t2-zhaoyun-ganfuren-simayi',
    name: '조운·감부인·사마의',
    season: 'S2',
    tier: 2,
    formation: '어린진',
    members: [
      mem('조운', '찬란한 위명', '예리한 통찰', [], ['신용', '기예', '승민']),
      mem('감부인', '금성의 철벽', '준비 완료', ['천하평론', '전쟁 종식'], [
        '한녀전',
        '수세',
        '기예',
      ]),
      mem('사마의', '허실간파', '청천벽력', ['문과 양', '충신의 기재', '기문둔갑'], [
        '대략',
        '기지',
        '요적',
      ]),
    ],
  },
  {
    id: 's2-t2-zhaoyun-ganfuren-guanyu',
    name: '조운·감부인·관우',
    season: 'S2',
    tier: 2,
    formation: '어린진',
    members: [
      mem('조운', '찬란한 위명', '예리한 통찰', ['팔방전', '전략지원', '측면 공격'], [
        '신용',
        '기예',
        '승적',
      ]),
      mem('감부인', '금성의 철벽', '준비 완료', ['청낭 치료', '전쟁 종식'], [
        '한녀전',
        '수세',
        '기예',
      ]),
      mem('관우', '기민한 전술', '칠군수몰', ['기문둔갑'], ['왕예', '여심', '기동']),
    ],
  },
  {
    id: 's2-t2-yuejin-zhenji-xuchu',
    name: '악진·견희·허저',
    season: 'S2',
    tier: 2,
    formation: '언월진',
    members: [
      mem('악진', '팔방전', '천하평론', ['경무장'], ['동등', '병령', '수토']),
      mem('견희', '금성의 철벽', '정의의 희생', ['전쟁 종식', '일심협력'], [
        '<낙신부>하',
        '선용',
        '적용',
      ]),
      mem('허저', '신속전개', '철기병 돌격', ['천리기습', '천군 소탕'], [
        '정남권종',
        '돌투',
        '만전',
      ]),
    ],
  },
  {
    id: 's2-t2-ganfuren-zhaoyun-gongsunzan',
    name: '감부인·조운·공손찬',
    season: 'S2',
    tier: 2,
    formation: '추형진',
    members: [
      mem('감부인', '백전불태', '문과 양', ['준비 완료', '전쟁 종식'], [
        '한녀전',
        '수세',
        '기예',
      ]),
      mem('조운', '병력강화', '용맹한 삼군', ['예리한 통찰', '찬란한 위명'], [
        '신용',
        '기예',
        '승민',
      ]),
      mem('공손찬', '연전연승', '패잔병 척결', ['늠름한 자태'], ['서좌', '돌투', '돌전']),
    ],
  },
  {
    id: 's2-t2-ganfuren-zhaoyun-mayunlu',
    name: '감부인·조운·마운록',
    season: 'S2',
    tier: 2,
    formation: '어린진',
    members: [
      mem('감부인', '찬란한 위명', '예리한 통찰', ['팔방전', '전략지원', '측면 공격'], [
        '한녀전',
        '수세',
        '기예',
      ]),
      mem('조운', '보급 차단', '준비 완료', ['문과 양', '전쟁 종식'], [
        '신용',
        '기예',
        '승적',
      ]),
      mem('마운록', '경무장', '늠름한 자태', ['신속전개', '철기병 돌격', '야습'], [
        '풍속통의',
        '돌투',
        '돌전',
      ]),
    ],
  },
  {
    id: 's2-t2-zhuge-daqiao-huanggai',
    name: '제갈량·대교·황개',
    season: 'S2',
    tier: 2,
    formation: '안형진',
    members: [
      mem('제갈량', '연전연승', '문과 양', ['독설가', '충신의 기재'], [
        '출사표',
        '현기',
        '탈계',
      ]),
      mem('대교', '세금 과징수', '보급 차단', ['고요한 제압', '전쟁 종식'], [
        '상사문부',
        '합모',
        '병교',
      ]),
      mem('황개', '지혜의 바람', '천하평론', ['견고한 방어', '전략지원'], [
        '견결',
        '기동',
        '여심',
      ]),
    ],
  },
]
